In [58]:
import pandas as pd
import warnings
warnings.filterwarnings("ignore")

# Read the CSV file into a DataFrame
data = pd.read_csv("Data.csv")

# Remove rows with missing values (in any column)
data.dropna(inplace=True)
print(data)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [11]:
# Convert the 'Country' column values to uppercase
data["Country"] = data["Country"].str.upper()
print(data)

   Country   Age   Salary Purchased
0   FRANCE  44.0  72000.0        No
1    SPAIN  27.0  48000.0       Yes
2  GERMANY  30.0  54000.0        No
3    SPAIN  38.0  61000.0        No
5   FRANCE  35.0  58000.0       Yes
7   FRANCE  48.0  79000.0       Yes
8  GERMANY  50.0  83000.0        No
9   FRANCE  37.0  67000.0       Yes

In [12]:
# Create a new column 'index' that finds the first 
# occurrence of "A" in each country name
data["index"] = data["Country"].str.find("A")
print(data)

   Country   Age   Salary Purchased  index
0   FRANCE  44.0  72000.0        No      2
1    SPAIN  27.0  48000.0       Yes      2
2  GERMANY  30.0  54000.0        No      4
3    SPAIN  38.0  61000.0        No      2
5   FRANCE  35.0  58000.0       Yes      2
7   FRANCE  48.0  79000.0       Yes      2
8  GERMANY  50.0  83000.0        No      4
9   FRANCE  37.0  67000.0       Yes      2

In [13]:
# Create a new DataFrame (data2) containing only rows where 'Country' 
# column contains "FRANCE"
data2 = data[data.Country.str.contains("FRANCE")]
print(data2)

  Country   Age   Salary Purchased  index
0  FRANCE  44.0  72000.0        No      2
5  FRANCE  35.0  58000.0       Yes      2
7  FRANCE  48.0  79000.0       Yes      2
9  FRANCE  37.0  67000.0       Yes      2

In [14]:
# Replace all occurrences of "A" with "a" in the 'Country' column 
# and store the result in data3
data3 = data.Country.str.replace("A", "a")
print(data3)

0     FRaNCE
1      SPaIN
2    GERMaNY
3      SPaIN
5     FRaNCE
7     FRaNCE
8    GERMaNY
9     FRaNCE
Name: Country, dtype: object

In [15]:
# Attempt to split 'Country' values at each "a" (lowercase) 
data[["Before 'A'", "After 'A'"]] = data["Country"].str.split("A", expand=True)
print(data)

   Country   Age   Salary Purchased  index Before 'A' After 'A'
0   FRANCE  44.0  72000.0        No      2         FR       NCE
1    SPAIN  27.0  48000.0       Yes      2         SP        IN
2  GERMANY  30.0  54000.0        No      4       GERM        NY
3    SPAIN  38.0  61000.0        No      2         SP        IN
5   FRANCE  35.0  58000.0       Yes      2         FR       NCE
7   FRANCE  48.0  79000.0       Yes      2         FR       NCE
8  GERMANY  50.0  83000.0        No      4       GERM        NY
9   FRANCE  37.0  67000.0       Yes      2         FR       NCE

In [16]:
# Creating dictionaries to represent customer and order data
costumers = {
    "CostumID": [1, 2, 3, 4], 
    "Firstname": ["john", "jake", "johnny", "jerry"],
    "Lastname": ["vivienne", "miranda", "james", "miranda"]
}
costumersB = {
    "CostumID": [4, 5, 6, 8],  # Keeping 'CostumID' consistent
    "Firstname": ["michael", "nelly", "venji", "mateo"],
    "Lastname": ["vivienne", "kelly", "gomez", "gomez"]
}
orders = {
    "OrderID": [10, 11, 12, 13],
    "CostumID": [1, 2, 5, 7],  # 'CostumID' for the relation to 'costumers'
    "OrderDate": [2012, 2013, 2019, 2023]
}
# Creating DataFrames for customers and orders
df_coustums = pd.DataFrame(costumers, columns=["CostumID", 
                                               "Firstname", "Lastname"])
df_orders = pd.DataFrame(orders, columns=["OrderID", "CostumID", "OrderDate"])

print(df_coustums)  # Printing customer data
print(df_orders)    # Printing order data

   CostumID Firstname  Lastname
0         1      john  vivienne
1         2      jake   miranda
2         3    johnny     james
3         4     jerry   miranda
   OrderID  CostumID  OrderDate
0       10         1       2012
1       11         2       2013
2       12         5       2019
3       13         7       2023

In [17]:
# MERGE operations (joining dataframes side by side)

# Inner merge (only rows with matching 'CostumID' in both DataFrames)
merged = pd.merge(df_coustums, df_orders, how="inner", on="CostumID")
print(merged)

   CostumID Firstname  Lastname  OrderID  OrderDate
0         1      john  vivienne       10       2012
1         2      jake   miranda       11       2013

In [18]:
# Left merge (all rows from 'df_coustums', matching rows from 'df_orders')
merged2 = pd.merge(df_coustums, df_orders, how="left", on="CostumID")
print(merged2)

   CostumID Firstname  Lastname  OrderID  OrderDate
0         1      john  vivienne     10.0     2012.0
1         2      jake   miranda     11.0     2013.0
2         3    johnny     james      NaN        NaN
3         4     jerry   miranda      NaN        NaN

In [19]:
# Right merge (all rows from 'df_orders', matching rows from 'df_coustums')
merged3 = pd.merge(df_coustums, df_orders, how="right", on="CostumID")
print(merged3)

   CostumID Firstname  Lastname  OrderID  OrderDate
0         1      john  vivienne       10       2012
1         2      jake   miranda       11       2013
2         5       NaN       NaN       12       2019
3         7       NaN       NaN       13       2023

In [20]:
# Outer merge (all rows from both, matches where possible)
merged4 = pd.merge(df_coustums, df_orders, how="outer", on="CostumID")
print(merged4)

   CostumID Firstname  Lastname  OrderID  OrderDate
0         1      john  vivienne     10.0     2012.0
1         2      jake   miranda     11.0     2013.0
2         3    johnny     james      NaN        NaN
3         4     jerry   miranda      NaN        NaN
4         5       NaN       NaN     12.0     2019.0
5         7       NaN       NaN     13.0     2023.0

In [21]:
# CONCAT operations (stacking dataframes)

# Concatenating the customers data (costumers and costumersB) vertically
df_coustums = pd.DataFrame(costumers, columns=["CostumID", "Firstname", 
                                               "Lastname"])
df_coustB = pd.DataFrame(costumersB, columns=["CostumID", "Firstname", 
                                              "Lastname"])

# Vertical concatenation (stacking rows)
merged_vertical = pd.concat([df_coustums, df_coustB])
print(merged_vertical)

   CostumID Firstname  Lastname
0         1      john  vivienne
1         2      jake   miranda
2         3    johnny     james
3         4     jerry   miranda
0         4   michael  vivienne
1         5     nelly     kelly
2         6     venji     gomez
3         8     mateo     gomez

In [22]:
# Horizontal concatenation (side by side merging)
merged_horizontal = pd.concat([df_coustums, df_coustB], axis=1)
print(merged_horizontal)

   CostumID Firstname  Lastname  CostumID Firstname  Lastname
0         1      john  vivienne         4   michael  vivienne
1         2      jake   miranda         5     nelly     kelly
2         3    johnny     james         6     venji     gomez
3         4     jerry   miranda         8     mateo     gomez

In [23]:
import pandas as pd

# Creating a dictionary to represent the data
data = {
    "Col1": [2, 2, 2, 4, 5, 7, 5, 8, 8],
    "Col2": [1, 23, 32, 24, 25, 27, 25, 28, 28],
    "Col3": [1, 22, 222, 14, 55, 7, 5, 88, 8]
}

# Converting the dictionary into a DataFrame
df = pd.DataFrame(data)
print(df)

   Col1  Col2  Col3
0     2     1     1
1     2    23    22
2     2    32   222
3     4    24    14
4     5    25    55
5     7    27     7
6     5    25     5
7     8    28    88
8     8    28     8

In [24]:
# Finding unique values in "Col2"
unique = df["Col2"].unique()
print(unique)

[ 1 23 32 24 25 27 28]

In [25]:
# Finding the number of unique values in "Col1"
nunique = df["Col1"].nunique()
print(nunique)

5

In [26]:
# Counting the occurrences of each unique value in "Col1"
counts = df["Col1"].value_counts()
print(counts)

2    3
5    2
8    2
4    1
7    1
Name: Col1, dtype: int64

In [27]:
# Defining a function that returns the square of a number
def square(x):
    return x * x

# Defining a lambda function to calculate the square root of a number
divided = lambda x: x ** (1/2)

In [28]:
# Applying the "kareal" function to "Col2" (each element is squared)
df["Col2"] = df["Col2"].apply(square)
print(df)

   Col1  Col2  Col3
0     2     1     1
1     2   529    22
2     2  1024   222
3     4   576    14
4     5   625    55
5     7   729     7
6     5   625     5
7     8   784    88
8     8   784     8

In [29]:
# Applying the "bölüm" lambda function to "Col3" (square root of each element)
df["Col3"] = df["Col3"].apply(divided)
print(df)

   Col1  Col2       Col3
0     2     1   1.000000
1     2   529   4.690416
2     2  1024  14.899664
3     4   576   3.741657
4     5   625   7.416198
5     7   729   2.645751
6     5   625   2.236068
7     8   784   9.380832
8     8   784   2.828427

In [30]:
# Creating a new column "Col4" which is the square of each value in "Col1"
df["Col4"] = df["Col1"].apply(square)
print(df)

   Col1  Col2       Col3  Col4
0     2     1   1.000000     4
1     2   529   4.690416     4
2     2  1024  14.899664     4
3     4   576   3.741657    16
4     5   625   7.416198    25
5     7   729   2.645751    49
6     5   625   2.236068    25
7     8   784   9.380832    64
8     8   784   2.828427    64

In [31]:
# Printing information about the DataFrame (data types, memory usage, etc.)
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col1    9 non-null      int64
 1   Col2    9 non-null      int64
 2   Col3    9 non-null      float64
 3   Col4    9 non-null      int64
dtypes: float64(1), int64(3)
memory usage: 420.0 bytes
None

In [32]:
# Sorting the DataFrame by "Col3" in ascending order and printing the result
print(df.sort_values("Col3"))

   Col1  Col2       Col3  Col4
0     2     1   1.000000     4
6     5   625   2.236068    25
5     7   729   2.645751    49
8     8   784   2.828427    64
3     4   576   3.741657    16
1     2   529   4.690416     4
4     5   625   7.416198    25
7     8   784   9.380832    64
2     2  1024  14.899664     4

In [33]:
# Sorting the DataFrame by "Col3" in descending order and printing the result
print(df.sort_values("Col3", ascending=False))

   Col1  Col2       Col3  Col4
2     2  1024  14.899664     4
7     8   784   9.380832    64
4     5   625   7.416198    25
1     2   529   4.690416     4
3     4   576   3.741657    16
8     8   784   2.828427    64
5     7   729   2.645751    49
6     5   625   2.236068    25
0     2     1   1.000000     4

In [34]:
""" 
Creating a pivot table using "Col1" as the index, 
"Col3" as columns, and "Col2" as values
This creates a table where "Col1" values are the row labels,
"Col3" values are the column labels
"""
print(df.pivot_table(index="Col1", columns="Col3", values="Col2"))

Col3  1.000000   2.236068   2.645751   2.828427   3.741657   4.690416   \
Col1
2           1.0        NaN        NaN        NaN        NaN      529.0
4           NaN        NaN        NaN        NaN      576.0        NaN
5           NaN      625.0        NaN        NaN        NaN        NaN
7           NaN        NaN      729.0        NaN        NaN        NaN
8           NaN        NaN        NaN      784.0        NaN        NaN

Col3  7.416198   9.380832   14.899664
Col1
2           NaN        NaN     1024.0
4           NaN        NaN        NaN
5         625.0        NaN        NaN
7           NaN        NaN        NaN
8           NaN      784.0        NaN

In [65]:
import pandas as pd

# Load the CSV file into a DataFrame
df = pd.read_csv("Software Engineer Salaries.csv")

# Display the first 10 rows of the DataFrame
df.head(7)

,Company,Company Score,Job Title,Location,Date,Salary
0,ViewSoft,4.8,Software Engineer,"Manassas, VA",8d,$68K - $94K (Glassdoor est.)
1,Workiva,4.3,Software Support Engineer,Remote,2d,$61K - $104K (Employer est.)
2,"Garmin International, Inc.",3.9,C# Software Engineer,"Cary, NC",2d,$95K - $118K (Glassdoor est.)
3,Snapchat,3.5,"Software Engineer, Fullstack, 1+ Years of Expe...","Los Angeles, CA",2d,$97K - $145K (Employer est.)
4,Vitesco Technologies Group AG,3.1,Software Engineer,"Seguin, TX",2d,$85K - $108K (Glassdoor est.)
5,Spotify,3.9,Backend Engineer II,"New York, NY",1d,$123K - $175K (Employer est.)
6,Infor,4.0,Associate Software Engineer,"Alpharetta, GA",7d,$77K - $94K (Glassdoor est.)

In [66]:
# Get the total number of rows in the DataFrame
len(df.index)

870

In [67]:
# Calculate the mean of the 'Company Score' column
meanscore = df["Company Score"].mean()
print(meanscore)

3.895310519645121

In [68]:
# Filter rows where 'Company Score' is greater than or equal to the mean score
resss = df[df["Company Score"] >= meanscore]
print(resss.head(5))

                      Company  Company Score                    Job Title  \
0                    ViewSoft            4.8            Software Engineer
1                     Workiva            4.3    Software Support Engineer
2  Garmin International, Inc.            3.9         C# Software Engineer
5                     Spotify            3.9          Backend Engineer II
6                       Infor            4.0  Associate Software Engineer

         Location Date                         Salary
0    Manassas, VA   8d   $68K - $94K (Glassdoor est.)
1          Remote   2d   $61K - $104K (Employer est.)
2        Cary, NC   2d  $95K - $118K (Glassdoor est.)
5    New York, NY   1d  $123K - $175K (Employer est.)
6  Alpharetta, GA   7d   $77K - $94K (Glassdoor est.)

In [69]:
# Sort the filtered data by 'Company Score' in descending order
df2 = resss.sort_values("Company Score", ascending=False)
print(df2.head())

                                     Company  Company Score  \
452               Zurn Elkay Water Solutions            5.0
264                                  Flysoft            5.0
470  Engineering Technology Associates, Inc.            5.0
41                   Amazon.com Services LLC            5.0
420                          Hewlett Packard            5.0

                                        Job Title           Location  Date  \
452         Software Systems Engineer - Mason, OH          Mason, OH  30d+
264                             Software Engineer                NaN    2d
470  Full Stack Engineer II (Frontend) - Benefits  San Francisco, CA    2d
41       Software Dev Engineer - Computer Science        Seattle, WA    2d
420                             Software Engineer    Beavercreek, OH  30d+

                                       Salary
452            $144K - $196K (Glassdoor est.)
264             $78K - $112K (Glassdoor est.)
470  $16.00 - $46.00 Per Hour (Employer est.)
41              $112K - $165K (Employer est.)
420             $86K - $128K (Glassdoor est.)

In [70]:
# Group the data by 'Location' and calculate the mean 'Company Score' 
# (for each location)
# Sort the results by 'Company Score' in descending order
grouped = df.groupby("Location")[["Company Score"]
                    ].mean().sort_values("Company Score", ascending=False)

# Print the top 15 locations with the highest average 'Company Score'
print(grouped.head(15))

                      Company Score
Location
Framingham, MA                  5.0
Lorton, VA                      5.0
Northborough, MA                5.0
Farmington Hills, MI            5.0
Menlo Park, CA                  5.0
Los Altos, CA                   5.0
Norcross, GA                    5.0
Albuquerque, NM                 5.0
Brookfield, WI                  5.0
Pullman, WA                     4.9
Manassas, VA                    4.8
Jackson, MI                     4.8
Fairborn, OH                    4.8
Morris Plains, NJ               4.8
Redstone Arsenal                4.7

In [71]:
# Load the CSV file into a DataFrame
df = pd.read_csv("GBvideos.csv")

# Drop unnecessary columns from the DataFrame
df.drop(["thumbnail_link", "comments_disabled",
         "ratings_disabled", "video_error_or_removed",
         "description", "trending_date"], axis=1, inplace=True)

# Display the DataFrame after dropping the columns
print(df.head(3))

      video_id                                          title  \
0  Jw1Y-zhQURU  John Lewis Christmas Ad 2017 - #MozTheMonster
1  3s1rvMFUweQ      Taylor Swift: …Ready for It? (Live) - SNL
2  n1WpP7iowLc     Eminem - Walk On Water (Audio) ft. Beyoncé

         channel_title  category_id              publish_time  \
0           John Lewis           26  2017-11-10T07:38:29.000Z
1  Saturday Night Live           24  2017-11-12T06:24:44.000Z
2           EminemVEVO           10  2017-11-10T17:00:03.000Z

                                                tags     views   likes  \
0  christmas|"john lewis christmas"|"john lewis"|...   7224515   55681
1  SNL|"Saturday Night Live"|"SNL Season 43"|"Epi...   1053632   25561
2  Eminem|"Walk"|"On"|"Water"|"Aftermath/Shady/In...  17158579  787420

   dislikes  comment_count
0     10247           9479
1      2294           2757
2     43420         125882

In [72]:
# Calculate the mean number of likes and dislikes
likes_mean = df["likes"].mean()
dislikes_mean = df["dislikes"].mean()
print("Likes_mean:",likes_mean, "Dislike_mean:", dislikes_mean)  
# Uncomment to print the mean likes and dislikes

Likes_mean: 134519.55349984582 Dislike_mean: 7612.559975331483

In [73]:
# Display the first 50 rows of 'likes' and 'dislikes'
fifty = df[["likes", "dislikes"]].head(50)
print(fifty.head(10))

     likes  dislikes
0    55681     10247
1    25561      2294
2   787420     43420
3      193        12
4       30         2
5    52708      1431
6  1634124     21082
7    57309       749
8     2163       147
9   190084     15015

In [74]:
# Find the title of the video with the most views
most_views = df[df["views"].max() == df["views"]]["title"]
print(most_views)

28412    Nicky Jam x J. Balvin - X (EQUIS) | Video Ofic...
Name: title, dtype: object

In [75]:
# Display the top 10 most viewed videos along with their titles and views
mostts_viewed_ten = df.sort_values("views", 
                                   ascending=False).head(10)[["title", "views"]]
print(mostts_viewed_ten)

                                                   title      views
28412  Nicky Jam x J. Balvin - X (EQUIS) | Video Ofic...  424538912
28212  Nicky Jam x J. Balvin - X (EQUIS) | Video Ofic...  413586699
28008  Nicky Jam x J. Balvin - X (EQUIS) | Video Ofic...  402650804
27811  Nicky Jam x J. Balvin - X (EQUIS) | Video Ofic...  392036878
27615  Nicky Jam x J. Balvin - X (EQUIS) | Video Ofic...  382401497
27424  Nicky Jam x J. Balvin - X (EQUIS) | Video Ofic...  372399338
27241  Nicky Jam x J. Balvin - X (EQUIS) | Video Ofic...  362111555
27052  Nicky Jam x J. Balvin - X (EQUIS) | Video Ofic...  349987176
26861  Nicky Jam x J. Balvin - X (EQUIS) | Video Ofic...  339629489
34460  Te Bote Remix - Casper, Nio García, Darell, Ni...  337621571

In [77]:
# Group the data by 'category_id', calculate the mean of 'likes', 
# and sort the results by likes
categoried = df.groupby("category_id").mean().sort_values("likes")["likes"]
print(categoried.head())

category_id
19     9674.447917
2     24608.506944
25    25021.685714
26    26639.183091
15    28629.913858
Name: likes, dtype: float64

In [60]:
# Group the data by 'category_id', sum the 'comment_count', and sort 
# by comment count in descending order
summed = df.groupby("category_id").sum().sort_values("comment_count", 
                                    ascending=False)["comment_count"]
print(summed)  # Display the summed comment counts, sorted by comment count

category_id
10    293013140
24    116897440
22     18713149
23     16718816
1      15590011
17     10056226
25      9386604
29      7672790
26      7356296
20      6166994
28      4029065
27      1636903
15      1404698
2        505085
19       118177
43        80957
Name: comment_count, dtype: int64

In [54]:
# Create a new column 'title_len' to store the length of each video's title
df["title_len"] = df["title"].apply(len)
print(df[["title", "title_len"]])

                                                   title  title_len
0          John Lewis Christmas Ad 2017 - #MozTheMonster         45
1              Taylor Swift: …Ready for It? (Live) - SNL         41
2             Eminem - Walk On Water (Audio) ft. Beyoncé         42
3      Goals from Salford City vs Class of 92 and Fri...         76
4      Dashcam captures truck's near miss with child ...         55
...                                                  ...        ...
38911  Enrique Iglesias - MOVE TO MIAMI (Official Vid...         61
38912  Jacob Sartorius - Up With It (Official Music V...         51
38913                 Anne-Marie - 2002 [Official Video]         34
38914  Eleni Foureira - Fuego - Cyprus - LIVE - First...         75
38915  KYLE - Ikuyo feat.  2 Chainz & Sophia Black [A...         51

[38916 rows x 2 columns]

In [55]:
# Create a new column 'tags_count' to store the number of tags for each video
df["tags_count"] = df["tags"].apply(lambda x: len(x.split("|")))
print(df[["tags", "tags_count"]])

                                                    tags  tags_count
0      christmas|"john lewis christmas"|"john lewis"|...           9
1      SNL|"Saturday Night Live"|"SNL Season 43"|"Epi...          36
2      Eminem|"Walk"|"On"|"Water"|"Aftermath/Shady/In...           6
3      Salford City FC|"Salford City"|"Salford"|"Clas...           9
4                                                 [none]           1
...                                                  ...         ...
38911  Enrique Iglesias feat. Pitbull|"MOVE TO MIAMI"...           4
38912  jacob sartorius|"jacob"|"up with it"|"jacob sa...          41
38913  anne|"marie"|"anne-marie"|"2002"|"two thousand...          17
38914  Eurovision Song Contest|"2018"|"Lisbon"|"Cypru...           8
38915  Kyle|"SuperDuperKyle"|"Ikuyo"|"2 Chainz"|"Soph...          18

[38916 rows x 2 columns]

In [56]:
# Calculate the like ratio ('begeni_orani') as the ratio of likes 
# to total interactions (likes + dislikes)
df["like_ratio"] = df["likes"] / (df["dislikes"] + df["likes"] + 1)  
# +1 to avoid division by zero

# Sort the DataFrame by 'begeni_orani' in descending order
df = df.sort_values("like_ratio", ascending=False)

# Display the sorted DataFrame with columns 'likes', 'dislikes',
# and 'begeni_orani'
print(df[["likes", "dislikes", "like_ratio"]])

        likes  dislikes  like_ratio
38872  123856         0    0.999992
38704  112723         0    0.999991
38528  103086         0    0.999990
38356  100102         0    0.999990
38188   99719         0    0.999990
...       ...       ...         ...
7520        0         0    0.000000
7519        0         0    0.000000
21658       0         0    0.000000
21624       0         0    0.000000
1414        0         0    0.000000

[38916 rows x 3 columns]